<?php

/* @var $this yii\web\View */

$this->title = 'База кода';
?>
<div class="container">

    <div class="content-wrap">
        <p>Я создал этот сайт больше как напоминалку себе с примерами, некоторых кусочков кода, своего и чужого написания, которые довольно часто могут пригодиться там или сям!)</p>
        <p></p>
        <p>Все что я здесь размещаю, мне не жалко и можно этим пользоваться в любых целях, на свой страх и риск. Возможно, кто-нибудь будет присылать свои наработки, поэтому сразу имейте ввиду, все здесь находится в свободном доступе, поэтому будьте осторожны, не присылайте компрометирующую информацию.</p>
        <p></p>
        <p>В ближайшее время, я прицеплю какую-нибудь библиотеку для подсветки синтаксиса и начну делиться, пока сам не знаю как буду категорировать материалы, наверное, пока все будет в одной куче, а там посмотрим.</p>
        <p></p>
        <p>Как вы наверняка заметили, данный продукт сделан на Yii2, я даже не удосужился сменить дизайн или убрать копирайт Yii, потому что в дизайне я ничего не смыслю, а прорекламировать хороший продукт мне не жалко, тем более, что я его тут использую.</p>
        <p></p>
        <p>Насчет дизайна. Такие как я, да и вообще многие программисты относятся к дизайну, как к лишней заморочке, я тому не исключение. На сайте главное то, что можно найти полезную для себя информацию, и далеко не важно как она при этом выглядит, тем более, здесь хранилище кусков кода. Однако, если кто-то хочет поучаствовать в жизни и развитии ресурса, я могу рассмотреть ваши варианты и даже сам сверстать. Учитывайте, что сайт плотно сцеплен с bootstrap и макеты требуются соответствующие, под bootstrap 3. Отказываться от адаптивности встроенной системы, совершенно не хочется, тем более, я вообще не люблю заморачиваться и писать отдельно мобильные стили @media(max-width: бее). Хороший дизайн под бутстрап, обычно этого и не требует, почти все решается колонками, без написания дополнительных @media запростов css. </p>
        <p></p>
        <p>Всем добра, кто зашел на страницу, пока, вы наверное сделали это зря, но может в будущем, это будет еще одним хабрахабром).</p>
    </div>

</div>